app/controllers/items_controller.rb

  def update
    @item = Item.find_by!({ uuid: params[:uuid], user_id: params[:user_id] })
    @item.update!(item_params)
---
SELECT `items`.* FROM `items` WHERE `items`.`uuid` = 'a2f2e663-a95c-417b-b0ea-1689c32a3189' AND `items`.`user_id` = 1 LIMIT 1
UPDATE `items` SET `items`.`brand` = 'martin somet', `items`.`photo_url` = 'simas simas', `items`.`updated_at` = '2025-05-29 13:38:41.406570' WHERE `items`.`id` = 2