app/controllers/items_controller.rb

SELECT `items`.* FROM `items` WHERE `items`.`uuid` = 'f0077948-a1b6-456d-8b54-461940e8b306' AND `items`.`user_id` = 2 LIMIT 1
---
  def show
    @item = Item.find_by!({ uuid: params[:uuid], user_id: params[:user_id] })

INSERT INTO `items` (`uuid`, `price`, `brand`, `photo_url`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('e60049e5-4874-40d6-848c-606771128294', 1.23, 'nike', 'dammmmm', 1, 2, '2025-05-29 13:45:52.247815', '2025-05-29 13:45:52.247815')
---
  def create
    @item = Item.create!(
      user_id: params[:user_id].to_i,
      price: params[:price],
      brand: params[:brand],
      photo_url: params[:photo_url],
      status: 1,
    )

SELECT `items`.* FROM `items` WHERE `items`.`uuid` = '94c75eca-1f16-4b25-b96a-849b85bba9fc' AND `items`.`user_id` = 2 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 3
---
  def destroy
    @item = Item.find_by!({ uuid: params[:uuid], user_id: params[:user_id] })

    @item.destroy

SELECT `items`.* FROM `items` WHERE `items`.`uuid` = '94c75eca-1f16-4b25-b96a-849b85bba9fc' AND `items`.`user_id` = 2 LIMIT 1
UPDATE `items` SET `items`.`price` = 1.24, `items`.`brand` = 'nike', `items`.`photo_url` = 'url', `items`.`updated_at` = '2025-05-30 05:52:23.356442' WHERE `items`.`id` = 43
---
  def update
    @item = Item.find_by!({ uuid: params[:uuid], user_id: params[:user_id] })
    @item.update!(item_params)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 292 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`user_id` = 2 ORDER BY `items`.`created_at` DESC LIMIT 5 OFFSET 5
---
  def index
    @user = User.find(params[:user_id])
    @items = @user.items.page(params[:page])