app/controllers/users_controller.rb

  def show
    @user = User.find_by(uuid: params[:uuid])
---
SELECT `users`.* FROM `users` WHERE `users`.`uuid` = 'dcc170b4-909e-41e5-a8f7-39aa5ba9e0e6' LIMIT 1