app/jobs/items_remover_job.rb

DELETE FROM `items` WHERE (created_at < '2025-05-29 09:24:55.725520')
---
  def perform
    Item.where('created_at < ?', 1.hour.ago).delete_all